yuguoyu123456/ADS1299-Core-SDK/firmware/mcu/01_STMicroelectronics/_shared/stm32_ads1299_ready_app.c
#include "stm32_ads1299_ready_app.h"

#include <string.h>

ads1299_status_t stm32_ads1299_prepare(ads1299_t *dev,
                                       stm32_ads1299_profile_t profile) {
    if (!dev) return ADS1299_EINVAL;

    ads1299_status_t st = ads1299_sdatac(dev);
    if (st != ADS1299_OK) return st;

    switch (profile) {
        case STM32_ADS1299_PROFILE_EEG_250: {
            ads1299_eeg_profile_t p = ads1299_profile_eeg_250sps();
            return ads1299_profile_apply_eeg(dev, &p, 1);
        }
        case STM32_ADS1299_PROFILE_EEG_500: {
            ads1299_eeg_profile_t p = ads1299_profile_eeg_500sps();
            return ads1299_profile_apply_eeg(dev, &p, 1);
        }
        case STM32_ADS1299_PROFILE_EEG_1000: {
            ads1299_eeg_profile_t p = ads1299_profile_eeg_1ksps();
            return ads1299_profile_apply_eeg(dev, &p, 1);
        }
        case STM32_ADS1299_PROFILE_INTERNAL_TEST:
            return ads1299_profile_internal_test(dev,
                                                 ADS1299_GAIN_24,
                                                 ADS1299_TEST_FREQ_FCLK_2_21,
                                                 0);
        case STM32_ADS1299_PROFILE_INPUT_SHORT:
            return ads1299_profile_input_short(dev, ADS1299_GAIN_24);
        default:
            return ADS1299_EINVAL;
    }
}

ads1299_status_t stm32_ads1299_start(ads1299_t *dev,
                                     stm32_ads1299_stream_state_t *state) {
    if (!dev || !state) return ADS1299_EINVAL;
    memset(state, 0, sizeof(*state));
    return ads1299_profile_start_streaming(dev);
}

ads1299_status_t stm32_ads1299_read_one(ads1299_t *dev,
                                        stm32_ads1299_stream_state_t *state) {
    if (!dev || !state) return ADS1299_EINVAL;

    ads1299_status_t st = ads1299_read_frame_continuous(dev, &state->last_frame);
    if (st == ADS1299_OK) {
        state->sample_index++;
    } else {
        state->dropped_or_late_frames++;
    }
    return st;
}

ads1299_status_t stm32_ads1299_stop(ads1299_t *dev) {
    if (!dev) return ADS1299_EINVAL;
    return ads1299_profile_stop_streaming(dev);
}
